{
    "packageName": "com.Balonatronics.Butt",
    "title": "Butt",
    "description": "In 1983, future local access television host and all-around creativity virtuoso Jeremy Kellerman was finishing his B.A. in Communications at Wanetshaw Community College in Dearborn, Michigan. Of course, three short years later, he would achieve his Certification of Advising from DreamChangers Personal Empowerment School of Melville, Indiana [defunct], and in 1988, he would go on to host the famed TV series “The Jeremy Kellerman Advice Hour.” The rest is history. However, there’s another story from Kellerman’s formative years that has gone untold until today.\r\n\r\nNot satisfied with merely obtaining his degree, Jeremy Kellerman was already testing the limits of his incredible creative powers by dabbling in video game programming and design. In March of that year, he set to work on what would become a brilliant project sadly lost to the ages…until now. Inspired by the classics of that era such as “Pong,” “Pac-Man,” and “Rampaging Death Ape,” Kellerman developed a project he dubbed “The Angelic Struggle.” A deceptively simple yet addictive game, it featured an Angel of Positivity using the Bellows of Self-Empowerment to repel the onslaught of materialism waged by the Clouds of Despair. The game is interspersed with educational and inspirational information about famous philosophers and spiritual leaders, and other pertinent information, pre-dating the 1990s “edutainment” craze by over ten years.\r\n\r\nMatching simple game mechanics with an epic, spiritual storyline, “The Angelic Struggle” became an instant hit with beta-tester (and Kellerman’s roommate) David Munson. However, Kellerman programmed the game on his trusty “Rubendo 5000” personal computational device, and saved the master and sub-ter files on a Balonatronics SAWG-E Flopping Diskette, a.k.a. the infamous “Baloney Disk” released briefly in 1982 by fast food chain “Baloney Hut.” The game was ultimately lost due to the incompatibility of those devices with virtually every piece of technology invented before or since. After the death of Kellerman’s beloved wife, journalist and co-host Victoria Kellerman (neé Mendes), in 1996, the original equipment was lost and “The Angelic Struggle” was forgotten.\r\n\r\nIn 2014, Jeremy Kellerman’s nephew, Scott Kellerman, discovered the original “Baloney Disk” containing the game files, stored in a box of collectible ceramic puppies and politically incorrect antique figurines from the antebellum South. Fascinated by the disk’s bizarre history, and with his uncle’s blessing, Scott turned the disk over to his friend Johnny Weinstein, a local computer whiz. Against all odds, the young Mr. Weinstein was able to bring together the correct components to interface with the obscure, antiquated “Baloney Disk,” and import the original game files to a modern personal computer.\r\n\r\nWith the original coding miraculously intact, Johnny Weinstein and Scott Kellerman decided not to let the thirty year old effort go to waste, and resolved to finish and release the game themselves. Under the supervision of Jeremy Kellerman, the game was updated in various ways. Upon Scott’s suggestion, the game title was changed from “The Angelic Struggle” to simply “Butt,” a name, he believes, “resonates with the edgier, hip youth culture of today.” To reflect the title change, the sprites of the player character were also redesigned entirely. A professional pixel artist was called in to redesign another character. Originally referred to as “The Self-Actualized Self,” now the character is entirely new, featuring a pulse-pounding sci-fi\/Western back-story based on Scott’s own market research into modern gaming. Lastly, the original educational\/informational sections of the game were expanded, to reflect the changes in the world since the game was originally created three decades ago. \r\n\r\nLead Programmer and Restoration Director Johnny Weinstein had this to say:\r\n\r\n“I think the game is really fantastic, and it holds up remarkably well for something originally created in 1983. In terms of game-play alone, it could stand alongside many classics of that era. It was a lot of fun to work on, too, and I enjoyed adding in the updated educational sequences. Though some stuff appeared by itself since I started working on it, and I can’t explain that. Frankly, it’s spooky. It’s as if the program itself was alive, and evolving of its own volition since we re-activated it. I haven’t been this creeped out since Jeremy did that children’s show with the plate thing. Maybe we should study this thing some more before we release it.”\r\n\r\nGraphic Design Restoration Director Scott Kellerman added:\r\n\r\n“You’re worrying too much. Let’s just get this thing out there and maybe make some money. I want to buy me some Uggs. I bet those old racist figurines in the basement are worth something, too.”\r\n\r\n“But Scott, I don’t think it’s normal for - ”\r\n\r\n“Shut up and go eat a hot dog, nut warbler.”\r\n\r\nJeremy Kellerman concluded with this statement:\r\n\r\n“I’m delighted that “The Angelic Struggle” is finally going to be released after all this time. I just know that it will become part of the collective consciousness the same way my inspiring television series, “The Jeremy Kellerman Advice Hour,” did.  Now there will be a whole new way for people to see their own inner potential, and a whole new avenue for people to discover the creative genius and wellspring of pure creativity that is Kellerman.\r\n\r\nThink well, live well, and be well!\r\nJeremy Kellerman”\r\n",
    "players": [
        1
    ],
    "genres": [
        "Retro",
        "Short on Time?"
    ],
    "releases": [
        {
            "name": "1.0",
            "versionCode": 0,
            "uuid": "c43f9938-ee6e-4e6c-aeb9-f45f79801015",
            "date": "2014-04-01T17:44:59Z",
            "url": "https:\/\/devs-ouya-tv-prod.s3.amazonaws.com\/apps\/e76e18a4-de8f-4b27-8fa4-d0b0af128ce8\/com.Balonatronics.Butt\/c43f9938-ee6e-4e6c-aeb9-f45f79801015\/QH7CexzGTqOOB8qdGi2i_com.Balonatronics.Butt.apk",
            "size": 19216232,
            "md5sum": "f628f3c0bf419eb0d956a327f30d83d0",
            "publicSize": 92183,
            "nativeSize": 2924816
        }
    ],
    "media": {
        "discover": "http:\/\/ouya.cweiske.de\/game-images\/com.balonatronics.butt\/discover",
        "large": "https:\/\/d3e4aumcqn8cw3.cloudfront.net\/api\/file\/FyYmpH6RTv6Hvi4efpYc",
        "video": "https:\/\/vimeo.com\/90415498",
        "screenshots": [
            "https:\/\/d3e4aumcqn8cw3.cloudfront.net\/api\/file\/dzrfLrSsOY6X3nhRuhlQ",
            "https:\/\/d3e4aumcqn8cw3.cloudfront.net\/api\/file\/TehQtXcjT8uk0XHPHKnZ",
            "https:\/\/d3e4aumcqn8cw3.cloudfront.net\/api\/file\/9C8KtNlzSoezutUdNCOI",
            "https:\/\/d3e4aumcqn8cw3.cloudfront.net\/api\/file\/nJtxkgnBQlmQEAedBN42",
            "https:\/\/d3e4aumcqn8cw3.cloudfront.net\/api\/file\/2nWaWARKC2N2Xpi6e6wf"
        ],
        "details": [
            {
                "type": "video",
                "url": "https:\/\/vimeo.com\/90415498"
            },
            {
                "type": "image",
                "url": "https:\/\/www.filepicker.io\/api\/file\/dzrfLrSsOY6X3nhRuhlQ\/convert?w=720",
                "thumb": "https:\/\/www.filepicker.io\/api\/file\/dzrfLrSsOY6X3nhRuhlQ\/convert?w=245"
            },
            {
                "type": "image",
                "url": "https:\/\/www.filepicker.io\/api\/file\/TehQtXcjT8uk0XHPHKnZ\/convert?w=720",
                "thumb": "https:\/\/www.filepicker.io\/api\/file\/TehQtXcjT8uk0XHPHKnZ\/convert?w=245"
            },
            {
                "type": "image",
                "url": "https:\/\/www.filepicker.io\/api\/file\/9C8KtNlzSoezutUdNCOI\/convert?w=720",
                "thumb": "https:\/\/www.filepicker.io\/api\/file\/9C8KtNlzSoezutUdNCOI\/convert?w=245"
            },
            {
                "type": "image",
                "url": "https:\/\/www.filepicker.io\/api\/file\/nJtxkgnBQlmQEAedBN42\/convert?w=720",
                "thumb": "https:\/\/www.filepicker.io\/api\/file\/nJtxkgnBQlmQEAedBN42\/convert?w=245"
            },
            {
                "type": "image",
                "url": "https:\/\/www.filepicker.io\/api\/file\/2nWaWARKC2N2Xpi6e6wf\/convert?w=720",
                "thumb": "https:\/\/www.filepicker.io\/api\/file\/2nWaWARKC2N2Xpi6e6wf\/convert?w=245"
            }
        ]
    },
    "developer": {
        "uuid": null,
        "name": "Balonatronics",
        "supportEmail": "balonatronics@gmail.com",
        "supportPhone": null,
        "founder": false
    },
    "contentRating": "9+",
    "website": "www.baloneyhut.tk",
    "firstPublishedAt": "2014-04-01T17:44:59Z",
    "inAppPurchases": true,
    "overview": "Released in April 2014 by Balonatronics.",
    "premium": false,
    "rating": {
        "likeCount": 24,
        "average": 3,
        "count": 162
    }
}
