{
    "packageName": "com.tarsi.gamejam2",
    "title": "Hydro Rally 13",
    "description": "Controls: Use the left analog stick to steer and the \"O\" button to accelerate. The \"U\" and \"A\" buttons play with water effects and the \"Y\" button moves the boat to the center of the screen (for debugging purposes).\n\nTODOs:\n\n    Complete full \"season\" of races from the main menu. Minimally, the player should be introduced to each course, given a countdown to start each race, shown the time and number of laps remaining, and be taken from race to race.\n    Add more tracks. Currently just two are implemented, but adding tracks will be simple once the rest of the features are complete.\n    Implement multiplayer mode. Probably the best way to play until computer players are implemented.\n    Add boats, improve boat driving physics and controls, add more convincing graphical effects when boat is moving and accelerating\n    Improve water simulation. The water would be better rendered by a shader.\n\nThis game is a work in progress that began during the Ouya 10th Anniversary Game Jam. The Android SDK and AndroidStudio were used to develop the software and all art is hand drawn or generated by AI tools.",
    "players": [
        1
    ],
    "genres": [
        "Racing",
        "2023 Anniversary GameJam"
    ],
    "releases": [
        {
            "name": "1.0",
            "versionCode": 1,
            "uuid": "a3e5c5e5-dcc6-4987-b6f9-a604b1a8db25",
            "date": "2023-08-02T08:37:16Z",
            "url": "http://ouya.cweiske.de/apks/2023-07-jam/com.tarsi.gamejam2/com.tarsi.gamejam2-1.apk",
            "size": 6312277,
            "md5sum": "55dc8fc569b60c0146b7402e5400f42d",
            "cert_subject": "C = US, ST = state, L = city, O = Tarsi, OU = Mobile, CN = tarsi"
        }
    ],
    "discover": "http://ouya.cweiske.de/apks/2023-07-jam/com.tarsi.gamejam2/com.tarsi.gamejam2.jpg",
    "media": [],
    "developer": {
        "uuid": "11111111-edae-4b3e-95ec-12c17ced0d3c",
        "name": "tarsi",
        "founder": false
    },
    "contentRating": "Everyone",
    "website": "https://tarsi.itch.io/hydro-rally",
    "firstPublishedAt": "2023-08-02T08:38:13Z",
    "inAppPurchases": false,
    "overview": null,
    "premium": false,
    "rating": {
        "likeCount": 0,
        "average": 0,
        "count": 0
    }
}
