{
    "packageName": "com.midgarstudio.tsoso",
    "title": "The Secret Of Space Octopuses",
    "description": "The Secret of Space Octopuses is an horizontal scrolling adventure game, mixing platform, puzzle and combat.\r\n\r\nYou're following Little Buddy's story, a young earthling who after having been abducted by some aliens, him and his entire village, will try to escape from the world in which he's being held captive. To do so, he's going to build a robot out of various junk and trash named B.O.T (Bunch Of Trash) of outstanding capabilities. During his escape, Little Buddy will have the opportunity to unravel his abductor's secrets : The Space Octopuses and his attitude along the adventure will uncover two different endings.\r\nThe game's universe shows itself as cartoon parody within the SF gender where humour is sometime hiding strong language, giving the player freedom of imagination. The scenaristic scenes are but rarely imposed to the player it will then fall on him to observe the colorful environments  filled with informations, as well as listening to the numerous discussions between the octopuses to get a full grasp of the scenario. The player will also be able to get some support from the Codex which will fill itself up with useful data while Little buddy is exploring the world.\r\n\r\nDuring his quest, the player will have to explore the eight labyrinth-type levels that form the Ocotopus world. He'll be able to count on the support from B.O.T's capacities, able to jump, slide, grip, hit, deploy a shield but above all things, absorb various materials to recycle them into boxes. Whereas it'd be plants, rocks or metal boxes and even beasts, there are plenty of materials to choose from. Each material produces a specific type of box. Thus, absorbing rocks will provide RockBoxes which given their natural toughness, could be used as shields, projectiles or once piled up, stairs. Absorbing a particular type of plant will generate GlueBoxes which will have the particularity of sticking to any wall and physical object in the game. They will show themselves to be very useful to hold B.O.T. hanging from a ceiling or to a moving object, and will  prove themselves to be very efficient against enemies, getting them stuck on the ground for example.\r\n\r\nThere are all kinds of Boxes to discover by exploring the world entirely and the player will find that each box can be of multiple use (bouncing, anti-gravity, brightness, explosive etc...). The levels are designed as to give the player free will over the use of these boxes. Whenever an obstacle appears on his way, there never is only one way or one type of box to solve the problem. Its a gameplay based first and foremost on freedom and experimentation.\r\nAlong his journey, the player will cross the octopuses' path frequently, armed and ready to brawl. Despite them not being very tough, the octopuses balance that weakness by their numbers adding to the fact that the difficulty of the game is dynamic, adapting itself to the player's skill. The more this one sends octopuses to the hospital, the more the enemy's reinforcements will grow in number and fighting capabilities. On the opposite, if the player weakens or even starts to stack the beatings up, he won't be much of a menace anymore, the octopuses' presence will then lower within the levels. This leads to a game that matches every player's skill level without generating any frustration.\r\n\r\nThe Secret of Space Octopuses wishes to get back to the long lost atmosphere found in oldschool games while offering a modern and innovative gameplay. The characters are showing logical physical responses and respond perfectly to their environment. For example, hitting an enemy at point blank will make him move backwards whereas a hit loaded with momentum will send him flying into the scenery triggering huge landslides as dangerous to your enemies as they'll be for yourself ! The characters and environment's dynamic behavior will create totally unpredictable situations. Its a new way of playing that's been given to the player and he'll have to show himself to be ingenious and reactive.",
    "players": [
        1
    ],
    "genres": [
        "Platformer",
        "Puzzle/Trivia"
    ],
    "releases": [
        {
            "name": "1.01",
            "versionCode": 0,
            "uuid": "9b40480f-5651-410f-9a84-48b6b710acd1",
            "date": "2013-09-20T21:07:44Z",
            "url": "https://archive.org/download/ouya_com.midgarstudio.tsoso_1.01/The%20Secret%20Of%20Space%20Octopuses_1.01_com.midgarstudio.tsoso.apk",
            "size": 157900791,
            "md5sum": "2d6a3e3f54b8d4c4de13f366a95d2b54",
            "publicSize": 0,
            "nativeSize": 0,
            "cert_fingerprint": "9F:CE:9A:03:25:F9:4A:43:76:EC:33:DE:D4:40:3B:33:37:82:75:8F:64:8F:44:07:54:64:FF:8F:01:BA:EF:F7",
            "cert_subject": "C = US, O = Android, CN = Android Debug"
        }
    ],
    "discover": "http://ouya.cweiske.de/game-images/com.midgarstudio.tsoso/discover",
    "media": [
        {
            "type": "image",
            "url": "http://ouya.cweiske.de/game-images/com.midgarstudio.tsoso/screenshot-1",
            "thumb": "http://ouya.cweiske.de/game-images/com.midgarstudio.tsoso/screenshot-1-thumb"
        },
        {
            "type": "image",
            "url": "http://ouya.cweiske.de/game-images/com.midgarstudio.tsoso/screenshot-2",
            "thumb": "http://ouya.cweiske.de/game-images/com.midgarstudio.tsoso/screenshot-2-thumb"
        },
        {
            "type": "image",
            "url": "http://ouya.cweiske.de/game-images/com.midgarstudio.tsoso/screenshot-3",
            "thumb": "http://ouya.cweiske.de/game-images/com.midgarstudio.tsoso/screenshot-3-thumb"
        },
        {
            "type": "image",
            "url": "http://ouya.cweiske.de/game-images/com.midgarstudio.tsoso/screenshot-4",
            "thumb": "http://ouya.cweiske.de/game-images/com.midgarstudio.tsoso/screenshot-4-thumb"
        },
        {
            "type": "image",
            "url": "http://ouya.cweiske.de/game-images/com.midgarstudio.tsoso/screenshot-5",
            "thumb": "http://ouya.cweiske.de/game-images/com.midgarstudio.tsoso/screenshot-5-thumb"
        },
        {
            "type": "image",
            "url": "http://ouya.cweiske.de/game-images/com.midgarstudio.tsoso/screenshot-6",
            "thumb": "http://ouya.cweiske.de/game-images/com.midgarstudio.tsoso/screenshot-6-thumb"
        }
    ],
    "developer": {
        "uuid": "85177475-6a3f-422d-8746-4ff99910d7b2",
        "name": "Midgar Studio",
        "supportEmail": "contact@midgar-studio.com",
        "supportPhone": null,
        "founder": false
    },
    "contentRating": "9+",
    "website": "http://www.midgar-studio.com",
    "firstPublishedAt": "2013-09-20T21:07:44Z",
    "inAppPurchases": true,
    "overview": "Released in September 2013 by Midgar Studio.",
    "premium": false,
    "rating": {
        "likeCount": 102,
        "average": 3.51,
        "count": 68
    }
}
